{
  "jobs": [
    {
      "start": "Jul 2021",
      "end": "Present",
      "role": "Lead Software Developer",
      "company": "InterSystems",
      "description": "InterSystems is a vendor for high-performance, multi-model database platforms that drive application development and data management solutions. Its technology spans several industries, including finance, government, supply chain, and healthcare, of which Epic Systems is a premiere client.",
      "experiences": [
        "Wrote packageable demo for testing database read and write speeds when ingesting data from Kafka message service",
        "Implemented Velero backup feature for sandbox that hosts Kubernetes-based InterSystems applications",
        "Built pipeline customization tool that allows for configuration of loading, transformation, and validation steps for data in varied formats",
        "Designed interface for managing topology of data (primary keys, data types, etc.) in disparate sources available for loading"
      ],
      "image": "assets/images/database.jpeg"
    },
    {
      "start": "Mar 2020",
      "end": "Jul 2021",
      "role": "Mentor",
      "company": "Codementor",
      "description": "Codementor is a platform that connects users with freelance software developers to complete desired projects or generally help with coding. It's the largest code mentorship community in the world.",
      "experiences": [
        "Maintained relationships with clients by providing thoughtful documentation and progress updates",
        "Created Python application for cryptocurrency trading based on momentum strategy",
        "Assembled pipeline for building, testing, and version control in order to distribute code as PyPI packages"
      ],
      "image": "assets/images/mentor.jpeg"
    },
    {
      "start": "Jun 2019",
      "end": "Aug 2020",
      "role": "Full Stack & Machine Learning Engineer",
      "company": "Gravyty",
      "description": "Gravyty provides AI-driven tools and automation with the purpose of increasing fundraising capacity and community engagement. Their customer base consists mostly of higher education institutions and nonprofits.",
      "experiences": [
        "Expanded email template feature by connecting to a Yelp API and providing restaurant meeting suggestions with dynamic location",
        "Constructed Django web page for viewing donor interaction history, including search and filter inputs",
        "Spun off spaCy natural language processing module into microservice for more optimized vertical scaling",
        "Developed functionality for determining if text is referencing holidays or other moments in time"
      ],
      "image": "assets/images/fundraising.png"
    },
    {
      "start": "Jun 2018",
      "end": "Jul 2018",
      "role": "Alexa Software Developer",
      "company": "Boston College",
      "description": "Boston College collaborated with Amazon Alexa in order to develop a classroom Alexa skill that facilitates activities like discussions and note-taking.",
      "experiences": [
        "Held ongoing discussions with professors to collect stakeholder feedback and design applications based on user stories",
        "Built JavaScript APIs to retrieve assignments and discussion questions from Canvas, as well as store notes in Google Sheets",
        "Utilized speech recognition software and dialogue management techniques to produce organic interactions between Alexa and end users"
      ],
      "image": "assets/images/learning.jpeg"
    }
  ]
}